# PANDAS
- Open source library built on top of NumPy    
- Allows for fast analysis and data cleaning/prep  
- Excels in performance and productivity  
- Also has built in visualization features  
- Can work with data from a wide variety of sources 
- Python's version of Excel

# ** Series**
Similar to a NumPy array, but
- a series can have axis labels (can be indexed by a label)
- can hold any type of data object with Python as its data point (strings)

In [1]:
import numpy as np
import pandas as pd

# Create four separate python objects

# Create labels list
labels =['a','b','c']

# Python list
my_data = [10,20,30]

# Create Numpy array
arr = np.array(my_data)

# Create dictionary
d ={'a':10,'b':20,'c':30} #{;}

In [2]:
labels

['a', 'b', 'c']

In [3]:
my_data

[10, 20, 30]

In [4]:
arr

array([10, 20, 30])

In [5]:
d

{'a': 10, 'b': 20, 'c': 30}

In [6]:
# Create Pandas series from Python lists
pd.Series(my_data,labels) #unlike NumPy arrays, series have indices that are labeled, so you can call these data points using labeled index

a    10
b    20
c    30
dtype: int64

In [7]:
# Create Pandas series from NumPy array 
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int64

In [8]:
# Create Pandas series from dictionary
pd.Series(d) # Automatically takes keys of the dictionary and set as index then set value of that key to corresponding data point

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

### Using the Index

In [10]:
# Create series
ser1 = pd.Series([1,2,3,4],['USA','GERMANY','USSR','JAPAN'])
ser1

USA        1
GERMANY    2
USSR       3
JAPAN      4
dtype: int64

In [11]:
ser2 = pd.Series([1,2,5,4],['USA','GERMANY','ITALY','JAPAN'])
ser2

USA        1
GERMANY    2
ITALY      5
JAPAN      4
dtype: int64

In [12]:
# Get data point associated with USA label
ser1['USA'] # pass in index label -integer or string - depending on index data type

1

In [13]:
ser3= pd.Series(data=labels)
ser3

0    a
1    b
2    c
dtype: object

In [14]:
ser3[0]

'a'

In [15]:
# Add series
ser1 + ser2 # Get a NaN where it could not find index match

GERMANY    4.0
ITALY      NaN
JAPAN      8.0
USA        2.0
USSR       NaN
dtype: float64

# Dataframes
Workhorse of Pandas  
Collection of series (columns) that share the same index
Rows are series as well

In [16]:
import numpy as np
import pandas as pd
from numpy.random import randn

np.random.seed(101)

# Create Data Frame by passing in data, index, and column names
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

### Columns

In [17]:
# Grab a column using bracket notation
df['W'] # Single column, get back a series

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [18]:
# Select multiple columns by passing a list of columns
df[['W','Z']] # multiple columns, pass a list of column names. Get back a dataframe

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [19]:
# Create a new column
df['new'] = df['W'] + df['Y'] # define the column like it already exists
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [20]:
# Drop a column 
df.drop('new',axis = 1, inplace = True) # Set axis to 1 to look at columns. inplace = True if you want effect to be permanent
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [21]:
# Drop a row
df.drop('E')
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

### Selecting Rows with 2 methods
1. .loc()  index label 
2. .iloc() index location

In [22]:
# Select a row using label based index .loc method
df.loc['C']

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [23]:
# Select a row using position based index with .iloc method
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

### Subsetting Rows and Columns

In [24]:
# Select subset of row B and column Y using comma notation
df.loc['B','Y']

-0.8480769834036315

In [25]:
# Subset by passing in a list of rows and list of columns
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

### Conditional Selection

In [26]:
# Return boolean dataframe
df>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [27]:
# Grab row and columns where condition is true
df[df>0] # Get nulls when passing an entire data frame

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [28]:
# Pass a single column 
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [29]:
# Grab rows in the data frame that column Z is less than zero
df[df['Z']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [30]:
resultdf = df[df['W']>0]
resultdf['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [31]:
# One step
df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [32]:
# Selecting list of columns in one step
df[df['W']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

# Multiple Conditions

In [33]:
# And operator
df[(df['W']>0)&(df['Y']>1)] # Pass in each condition in parenthesis and use & symbol

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [34]:
# Pipe operator
df[(df['W']<0)|(df['Y']>1)]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

# Resetting the Index

In [35]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [36]:
# Reset index to numerical value 
df.reset_index() # close parenthesis to run the command. Old index will become a column in the dataframe. inplace= T permanent.

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

# Setting the index

In [37]:
# Create list without typing commas
newind ='CA NY WY OR CO'.split() #split() is a method to split a string on blank space
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [38]:
df['States'] = newind
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [39]:
# Specify column as an index
df.set_index('States',inplace= True) #overwrites old index! Need to specify inplace = True for change to be permanent

In [40]:
df

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

# Multi-Index and Index Hierachy
Index from the outside in step by step to get the data you want

In [41]:
import numpy as np
import pandas as pd

# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [42]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [43]:
inside

[1, 2, 3, 1, 2, 3]

In [44]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [45]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [46]:
# Grab everything under G1
df.loc['G1'] # call from the outside in

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [47]:
# Name the indexes
df.index.names = ['Groups','Num']

In [48]:
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [49]:
# Select G2, #2, Column B
df.loc['G2'].loc[2]['B']

0.07295967531703869

In [50]:
# Select G1, #3, Column A
df.loc['G1'].loc[3]['A']

-0.13484072060601238

In [51]:
# Index using cross section method
df.xs('G1')

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [52]:
df.xs(1,level = 'Num')

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

# Missing Data

In [53]:
import numpy as np
import pandas as pd

# Create dataframe with missing values
d ={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

# .dropna()

In [54]:
# Drop any row with any missing values
df.dropna()

     A    B  C
0  1.0  5.0  1

In [55]:
# Drop any column with missing values
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [56]:
# Drop rows with at least two NaN values
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

# .fillna()

In [57]:
# Fill in values
df.fillna(value = 'FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [58]:
# Fill NA with column mean
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# Group By
Allows you to group together rows based off of a column and perform an aggregate function on them

In [59]:
import numpy as np
import pandas as pd

# Create dictionary
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','James','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

# Create dataframe from dictionary
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG    James    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [60]:
# Group rows by company
byComp =df.groupby('Company')
byComp

In [61]:
# Get mean by company
byComp.mean() #don't have to specify sales column here because Pandas will ignore non-numeric columns

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [62]:
# Sum of sales per company
byComp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [63]:
# Standard deviation of sales per company
byComp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [64]:
# Sum of Sales for Facebook
byComp.sum().loc['FB'] # Return a dataframe with indexes so you can index off out result

Sales    593
Name: FB, dtype: int64

In [65]:
# Call in one line
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [66]:
# Count
df.groupby('Company').count() # Can also do .max() and .min()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [67]:
# Group by with describe method
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

# Merging, Joining, and Concatenating
There are 3 main ways of combining DataFrames together: 
1. Merging  
2. Joining    
3. Concatenating

In [68]:
# Create dataframes
import pandas as pd
df1= pd.DataFrame({'A':['A0','A1','A2','A3'],
                   'B':['B0','B1','B2','B3'],
                   'C':['C0','C1','C2','C3'],
                   'D':['DO','D1','D2','D3']},
                 index = [0,1,2,3])
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG    James    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [69]:
df2= pd.DataFrame({'A':['A4','A5','A6','A7'],
                   'B':['B4','B5','B6','B7'],
                   'C':['C4','C5','C6','C7'],
                   'D':['D4','D5','D6','D7']},
                 index = [4,5,6,7])
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [70]:
df3= pd.DataFrame({'A':['A8','A9','A10','A11'],
                   'B':['B8','B9','B10','B11'],
                   'C':['C8','C9','C10','C11'],
                   'D':['D8','D9','D10','D11']},
                 index = [8,9,10,11])
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

# Concatenation
Concatenation basically glues together DataFrames.    
Keep in mind that dimensions should match along the axis you are concatenating on.   
You can use **pd.concat** and pass in a list of DataFrames to concatenate together.  
Make sure you specify correct axis depending if you want to join together by rows (default) or columns (axis = 1)

In [71]:
# Concatenate dataframes by row (default)
pd.concat([df1,df2,df3]) # default axis is row

      A    B    C    D
0    A0   B0   C0   DO
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [72]:
# Concatenate dataframes along the columns, axis =1
pd.concat([df1,df2,df3], axis = 1) # most often joining columns together

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   DO  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

# Merging
The **merge** function allows you to merge DataFrames together using a similar logic as merging SQL Tables together.  
Instead of just glueing the dataframes together, going to see where the values match up on **columns** (keys) and then create the rows using that key column.

### Merging Example 1

In [73]:
# Create dataframe
left = pd.DataFrame({'key':['K0','K1','K2','K3'],
                       'A':['A0','A1','A2','A3'],
                       'B':['B0','B1','B2','B3']})
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [74]:
# Create second dataframe with same keys but different columns
right = pd.DataFrame({'key':['K0','K1','K2','K3'],
                       'C':['C0','C1','C2','C3'],
                       'D':['D0','D1','D2','D3']})
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [75]:
# Merge left and right
pd.merge(left,right, how = 'inner',on ='key') #inner is default

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

### Merging Example 2
Merging on multiple columns (keys)

In [76]:
# Create dataframe
left = pd.DataFrame({'key1':['K0','K1','K2','K3'],
                     'key2':['K0','K1','K0','K1'],
                       'A':['A0','A1','A2','A3'],
                       'B':['B0','B1','B2','B3']})
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K1   K1  A1  B1
2   K2   K0  A2  B2
3   K3   K1  A3  B3

In [77]:
right = pd.DataFrame({'key1':['K0','K1','K2','K3'],
                      'key2':['K0','K1','K0','K1'],
                       'C':['C0','C1','C2','C3'],
                       'D':['D0','D1','D2','D3']})
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K1  C1  D1
2   K2   K0  C2  D2
3   K3   K1  C3  D3

In [78]:
# Merge left and right
pd.merge(left,right, on=['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K1  A1  B1  C1  D1
2   K2   K0  A2  B2  C2  D2
3   K3   K1  A3  B3  C3  D3

In [79]:
# Outer Merge
pd.merge(left,right, how = 'outer', on = ['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K1  A1  B1  C1  D1
2   K2   K0  A2  B2  C2  D2
3   K3   K1  A3  B3  C3  D3

In [80]:
# Right Merge
pd.merge(left, right, how = 'right', on = ['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K1  A1  B1  C1  D1
2   K2   K0  A2  B2  C2  D2
3   K3   K1  A3  B3  C3  D3

In [81]:
# Left Merge
pd.merge(left,right, how = 'left', on =['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K1  A1  B1  C1  D1
2   K2   K0  A2  B2  C2  D2
3   K3   K1  A3  B3  C3  D3

# Joining
Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames into  as single result DataFrame.  
Same as merge except the keys you want to join on are actually on your **index** instead of a column  
If you want to merge dataframes based on other columns you'd have to use merge

In [82]:
left = pd.DataFrame({'A':['A0','A1','A2'],
                     'B':['B0','B1','B2']},
                      index = ['K0','K1','K2'])
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [83]:
right = pd.DataFrame({'C':['C0','C2','C3'],
                      'D':['D0','D2','D3']},
                      index =['K0','K2','K3'])
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [84]:
# Inner join between left and right based on index keys.
left.join(right) # join comes off one dataframe and you pass it the other one

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [85]:
left.join(right,how = 'outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

# Useful Operations

In [86]:
import numpy as np
import pandas as pd

# Create dataframe
df=pd.DataFrame({'col1':[1,2,3,4],
                 'col2':[444,555,666,444],
                 'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

# Finding Unique Values in a DataFrame
3 Useful Methods:  
1. unique()  
2. nunique()  
3. value_counts()

In [87]:
# Grab unique values in col2
df['col2'].unique()

array([444, 555, 666])

In [88]:
# Get number of unique values in col2
df['col2'].nunique()

3

In [89]:
# Count of each unique value
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [90]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

# **Apply Method**

In [91]:
# Create function
def times2(x): # takes in value x
    return x*2

# Use .apply to broadcast function to every element in the column
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [92]:
# Return length of each string
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [93]:
# Use lamda expression instead of entire function
df['col2'].apply(lambda x:x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

# Getting column and index name attributes

In [94]:
# Get list of column names
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [95]:
# Get list of index
df.index

RangeIndex(start=0, stop=4, step=1)

# Sorting

In [96]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

# Finding Null Values

In [97]:
# Finding nulls
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

# Pivot Table Method

In [98]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
        'B':['one','one','two','two','one','one'],
        'C':['x','y','x','y','x','y'],
        'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [99]:
# Create pivot table
df.pivot_table(values = 'D',index = ['A','B'], columns =['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# Data Input and Output
CSV, Excel, HTML, SQL
File will need to be in the same location as your Jupyter Notebook (check using pwd). If not, have to pass entire path

### **CSV**   
**To read csv**  
pd.read_csv  

**To write to csv**  
df.to_csv('My_output', index = False)

### **Excel**
**To read excel file**  
pd.read_excel('Excel_Sample.xlsx',sheetname= 'Sheet1')

**Write to excel**  
df.to_excel('Excel_Sample2.xlsx, sheet_name ='NewSheet')

### **HTML**
Webscraping with Pandas  

**Read html**  
data = pd.read_html('mylink')

### **SQL**
Pandas not always the best for every version of SQL  

from sqlalchemy import create_engine  
engine = create_engine('sqlite:///:memory:') 

df.to_sql('my_table, engine)  
sqldf = pd.read_sql('my_table', con=engine)

# EXERCISES

**Import pandas as pd**  
import pandas as pd

**Read Salaries.csv as a dataframe called sal**  
sal = pd.read_csv('Salaries.csv')

**Check head of the dataframe**  
sal.head(2)

**Use the .info() method to find out how many entries there are**  
sal.inf()

**What is the average BasePay?**  
sal['BasePay'].mean()

**What is the highest amount of Overtime Pay in the dataset?**  
sal['OvertimePay'].max()

**What is the job title of JOSEPH DRISCOLL?**  
sal[sal[EmployeeName]'=='JOSEPH DRISCOLL']['JobTitle']

** How much does JOSEPH DISCOLL make (including benefits)?**  
sal[sal['EmployeeName']=='JOSEPH DRISCOLL']['TotalPayBenefits']

** What is the name of the highest paid person (including benefits)?**  
sal[sal['TotalPayBenefits']==sal['TotalPayBenefits'].max()]['EmployeeName']

** What is the name of the lowest paid person (including benefits)? Do you notice something strange about how much he is paid?**  
sal[sal['TotalPayBenefits']==sal['TotalPayBenefits'].min()]['EmployeeName']

** What was the average (mean) BasePay of all employees per Year (2011-2014)?**  
sal.groupby('Year').mean()['BasePay']

** How many unique job titles are there?**  
sal['JobTitle'].nunique()

** What are the top 5 most common jobs?**  
sal['JobTitle'].value_counts().head(5)

** How many job titles were represented by only one person in 2013?**  
sum(sal[sal['Year']==2013]['Job Title'].value_counts()==1)

** How many people have the word Cheif in their job title?**  
sal['JobTitle']

def chief_string(title):  
   if 'chief' in title.lower().split():  
       return True  
   else:  
       return False  
     
sum(sal['JobTitle'].apply(lambda x: chief_string(x)))  
     
** Bonus: Is there a correlation between length of the Job Title string and Salary?**  
sal['title_len'] = sal['JobTitle'].apply(len)

sal[['TotalPayBenefits','title_len']].corr()

# ECOMMERCE PURCHASE EXERCISE

import pandas as pd  
ecom = pd.read_csv('Ecommerce_Purchases.cvs')  

ecom.head()  

**How many rows and columns are there?**  
len(ecom.columns)  
len(ecom.index)  
ecom.info()  

**What is the average purchase price?**  

ecom.columns  
ecom['Purchase Price'].mean()  

**What is the highest/lowest purchae price?**  
ecom['Purchase Price'].max()  
ecom['Purchase Price'].min()  

**How many people have English 'en' as their Language of choice on the website?"**    

ecom[ecom['Language']=='en']['Language'].count()  

** How many people have the job title of "Lawyer"?"**  
ecom[ecom['Job Title']=='Lawyer'].info()  

** How many people made the purchase during the AM and how many people made the purchase during PM?**     
ecom['AM or PM'].unique()
ecom['AM or PM'].value_counts()

** What are the 5 most common Job Titles?**  
ecom['Job'].value_counts().head(5) # Automatically sorts

** Someone made a purchase that came from Lot:"90 WT", what was the Purchase Price for this transaction?"**
ecom[ecom['Lot']=='90 WT']['Purchase Price']


** What is the email of the person with the following Credit Card Number: 4926535242672853?**
ecom[ecom['Credit Card Number']==4926535242672853]['Email']

** How many people have American Express as their Credit Card Provider and made a purchase above 95? **  

ecom[(ecom[CC Provider]=='American Express') & (ecom[Purchase Price] >= 95)].info()

** How many people have a credit card that expires in 2025?"**    

sum(ecom['CC Exp Date'].apply (lambda exp: exp[3:] =='25'))
ecom[ecom['CC Exp Date'].apply (lambda exp: exp[3:]=='25')].count()

** What are the top 5 most popular email providers/hosts?**  example_email = ecom['Email'].iloc[0]
example_email.split('@')[1] 

Use logic above into a lambda expression
ecom['Email'].apply(lambda email: email.split('@')[1])